/*
 Задание 1

Цель задания
Научиться генерировать произвольные массивы. Научиться адаптировать существующий код под ситуацию.

Задание
Напишите генератор массивов длиной count со случайными числами от n до m. Учтите, что n и m могут быть отрицательными, а также может быть n > m или n < m. Выведите результат с помощью console.log.

Проверка результата
Для проверки подставляйте различные значения count, m, n и смотрите на корректность результата. Примеры значений для проверки:
n = 0, m = 100, count = 100;
n = 2, m = 5, count = 50;
n = 100, m = -5, count = 70;
n = -3, m = -10, count = 42.
 */

console.log('Задание №1');

let n = -3;
let m = -10;
let count = 42;
let arr = [];

let minNumber = Math.min(n, m);
let range = Math.abs(m - n);

for (let i = 0; i < count; ++i) {
  arr.push(Math.round(Math.random() * range + minNumber));
}

console.log(arr);

/*
Задание 2

Цель задания
Научиться обрабатывать строки как массивы.

Задание
С помощью цикла создать перевёрнутый вариант произвольной строки. Например, строка «Привет, мир!» должна превратиться в «!рим ,тевирП».

Проверка результата
Для проверки подставляйте различные варианты строк и проверьте результат. Примеры для проверки:
'Привет, мир!' → '!рим ,тевирП';
'1' → '1';
'' → ''.
 */

console.log('Задание №2');

let str = `Привет, мир!`;
let str2 = ``;

for (let a = str.length - 1; a>= 0; --a) {
 str2 += str[a];
 }

console.log(str2);

/*
Задание 3

Цель задания
Научиться корректно переводить требования к сложному заданию в код (необязательно сложный). Соединить знания о boolean, массивах и циклах.

Задание
Танк едет по дороге, на которой могут быть противотанковые мины. Дорога должна быть представлена в виде массива roadMines из 10 boolean-элементов. Если элемент равен true, то это мина. Движение танка должно быть представлено как цикл, в котором одна итерация — продвижение танка на следующий участок дороги (следующий элемент массива). При передвижении выводить в консоль сообщение «танк переместился на ${position}», где position — номер ячейки + 1. Если танк попал на мину, то нужно вывести сообщение «танк повреждён», если это 1-й взрыв, и «танк уничтожен», если это 2-й взрыв. После 2-го взрыва танк считается уничтоженным и прекращает движение.

Проверка результата
Проверьте работу кода на разных вариантах значений в массиве roadMines. Примеры для проверки:
Для roadMines = [true, true, true, true, true, true, true, true, true, true] вывод: танк переместился на 1, танк повреждён, танк переместился на 2, танк уничтожен.
Для roadMines = [true, false, false, false, false, false, false, false, false, true] вывод: танк переместился на 1, танк повреждён, танк переместился на 2, 3, 4, 5, 6, 7, 8, 9, 10, танк уничтожен.
Для roadMines = [false, false, false, true, false, false, false, false, false, false] вывод: танк переместился на 1, 2, 3, 4, танк повреждён, танк переместился на 5, 6, 7, 8, 9, 10.
Для roadMines = [false, false, false, false, false, false, false, false, false, false] вывод: танк переместился на 1, 2, 3, 4, 5, 6, 7, 8, 9, 10.
*/

console.log('Задание №3');

let roadMines = [true, true, true, true, true, true, true, true, true, true];
let crash = 0; // Переменная повреждения танка.
let armor = 1; // Добавил переменную брони. Изменив её танк сможет проходить больше мин.

for (let position = 0; position < roadMines.length; ++position) {
  console.log(`танк переместился на ${position + 1}`)
  if (roadMines[position] === true && crash < armor) {
    crash += 1;
    console.log(`танк повреждён`);
  }
  else if (roadMines[position] === true && crash >= armor) {
    console.log(`танк уничтожен`);
    break;
  }
}

/*
Задание 4

Цель задания
Научиться работать одновременно с несколькими массивами. Познакомиться с реальным практическим примером применения массивов и циклов в приложениях (слайдер дней календаря, планировщик и т.п.). Соединить знания о массивах, циклах, строках и математических операциях.

Задание
Сгенерировать массив чисел 1–31 включительно (числа месяца). Вывести с помощью console.log для каждого из чисел строку ${число} января, ${день недели}. День недели 1 января должен задаваться с помощью переменной, то есть программа должна корректно работать для любого дня недели, с которого начинается месяц. Подсказка 1: для дней недели можно создать массив с названиями дней, чтобы обращаться к нему по индексу. Подсказка 2: индекс дня недели можно вычислить с помощью операции остатка от деления.

Проверка результата
Для любого указанного дня недели 1 января все дни выводятся корректно. Например, для вторника:
1 января, вторник
2 января, среда
3 января, четверг
4 января, пятница
5 января, суббота
6 января, воскресенье
7 января, понедельник
и т.д.
 */

console.log(`Задание №3`);

let days = [
  'понедельник',
  'вторник',
  'среда',
  'четверг',
  'пятница',
  'суббота',
  'воскресенье',
];

let posDay = 2; // 1 => Понедельник, 2 => Вторник, 3 => Среда, 4 => Четверг и т.д..

for (let i = 1; i <= 31; ++i) {
  console.log(`${i} января, ${days[(posDay + (i - 2)) % 7]}`);
}
